const pokemonArtIds:Record<string,number>={
  "アブソル":359,"アマージョ":763,"アローラキュウコン":10104,"アローラライチュウ":10100,
  "イワパレス":558,"インテレオン":818,"ウーラオス":892,"ウッウ":845,"エースバーン":815,
  "エーフィ":196,"エンペルト":395,"オーロット":709,"カイリキー":68,"カイリュー":149,
  "カビゴン":143,"カメックス":9,"ガブリアス":445,"ガラルギャロップ":10162,"キュワワー":764,
  "ギャラドス":130,"ギルガルド":681,"グレイシア":471,"グレンアルマ":936,"ゲッコウガ":658,
  "ゲンガー":94,"コダック":54,"サーナイト":282,"ザシアン":888,"シャンデラ":609,
  "ジュナイパー":724,"ジュラルドン":884,"シャワーズ":134,"スイクン":245,"ストライク":123,
  "ゼラオラ":807,"ソウブレイズ":937,"ゾロアーク":571,"タイレーツ":870,"ダークライ":491,
  "ダダリン":781,"デカヌチャン":959,"ドードリオ":85,"ドラパルト":887,"ニンフィア":700,
  "ヌメルゴン":706,"ハッサム":212,"ハピナス":242,"バシャーモ":257,"バリヤード":122,
  "バンギラス":248,"パーモット":923,"ピカチュウ":25,"ピクシー":36,"ファイアロー":663,
  "フーパ":720,"フシギバナ":3,"ブラッキー":197,"プクリン":40,"ホウオウ":250,
  "マスカーニャ":908,"マッシブーン":794,"マフォクシー":655,"マホイップ":869,"マリルリ":184,
  "マンムー":473,"ミミッキュ":778,"ミュウ":151,"ミュウツーX":10043,"ミュウツーY":10044,
  "ミライドン":1008,"メタグロス":376,"ヤドラン":80,"ヤミラミ":302,"ヨクバリス":820,
  "ラティアス":380,"ラティオス":381,"ラプラス":131,"リーフィア":470,"リザードン":6,
  "ルカリオ":448,"ワタシラガ":830,
};

export function pokemonArtUrl(name:string){
  const id=pokemonArtIds[name];
  return id?`https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/other/official-artwork/${id}.png`:"";
}
